<!-- Trabalho Desenvolvido no Curso da Data Science Academy - www.datascienceacademy.com.br -->
# <font color='blue'>Data Science Academy</font>
# <font color='blue'>Fundamentos de Linguagem Python - Do Básico a Aplicações de IA</font>
# <font color='blue'>Limpeza, Transformação e Análise de Dados com Pandas </font>

## O Que é e Quando Usar o Pandas?

Leia o manual em pdf no Capítulo 9 do Curso.

In [1]:
!pip install -q -U watermark

In [2]:
# Imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
%reload_ext watermark
%watermark -a "Data Science Academy"

Author: Data Science Academy

In [5]:
%watermark --iversions

matplotlib: 3.10.0
numpy     : 2.3.2
pandas    : 2.3.1

## 1- Pandas e Estruturas de Dados - Series e DataFrame

Vamos começar criando as estruturas de dados fundamentais: Series e DataFrame.

No Pandas, uma Series (uma série) é uma estrutura unidimensional, parecida com uma coluna de uma tabela: contém uma sequência de valores com um índice associado. Já um DataFrame é uma estrutura bidimensional, semelhante a uma planilha, tabela ou matriz, formada por várias colunas (que são, internamente, Series alinhadas pelo mesmo índice).

In [4]:
# Criando uma Series (uma única coluna)
s = pd.Series([10, 20, 30, 40, 50], name = 'Valores')

In [5]:
type(s)

pandas.core.series.Series

In [6]:
print("\n--- Exemplo de Series ---\n")
print(s)
print("\n")

--- Exemplo de Series ---

0    10
1    20
2    30
3    40
4    50
Name: Valores, dtype: int64

In [7]:
# Criamos um dicionário em Python (observe que alguns valores estão nulos representados como None)
dados = {
    'Nome': ['Ana', 'Bruno', 'Fabiana', 'Ronaldo', 'Eliana', 'Matias'],
    'Idade': [28, 34, 29, 17, None, 78],
    'Cidade': ['Blumenau', 'São Paulo', 'Blumenau', 'São Paulo', 'Salvador', 'São Paulo'],
    'Salário': [None, 7500, 6200, 9300, 8100, 15400]
}

In [8]:
type(dados)

dict

In [9]:
print(dados)

{'Nome': ['Ana', 'Bruno', 'Fabiana', 'Ronaldo', 'Eliana', 'Matias'], 'Idade': [28, 34, 29, 17, None, 78], 'Cidade': ['Blumenau', 'São Paulo', 'Blumenau', 'São Paulo', 'Salvador', 'São Paulo'], 'Salário': [None, 7500, 6200, 9300, 8100, 15400]}

In [10]:
# Convertemos o dicionário em um dataframe do pandas
df_dsa = pd.DataFrame(dados)

In [11]:
type(df_dsa)

pandas.core.frame.DataFrame

In [12]:
print("\n--- Exemplo de DataFrame ---\n")
print(df_dsa)

--- Exemplo de DataFrame ---

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

## 2- Leitura e Escrita de Dados no Formato CSV

Pandas torna muito fácil salvar seu DataFrame em um arquivo CSV e carregá-lo de volta.

In [13]:
# Escrevendo (salvando) o DataFrame em um arquivo CSV
# index=False evita que o índice do DataFrame seja salvo como uma coluna no CSV
df_dsa.to_csv('dados_funcionarios_sem_indice.csv', index = False, encoding = 'utf-8')

In [14]:
# Escrevendo (salvando) o DataFrame em um arquivo CSV
# index=True (valor padrão) inclui o índice do DataFrame como uma coluna no CSV
df_dsa.to_csv('dados_funcionarios_com_indice.csv', encoding = 'utf-8')

In [15]:
# Lendo dados de um arquivo CSV para um novo DataFrame
df_dsa_1 = pd.read_csv('dados_funcionarios_sem_indice.csv')

In [16]:
# Visualizando as primeiras linhas
df_dsa_1.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [17]:
# Lendo dados de um arquivo CSV para um novo DataFrame
df_dsa_2 = pd.read_csv('dados_funcionarios_com_indice.csv')

In [18]:
# Visualizando as primeiras linhas
df_dsa_2.head(6)

   Unnamed: 0     Nome  Idade     Cidade  Salário
0           0      Ana   28.0   Blumenau      NaN
1           1    Bruno   34.0  São Paulo   7500.0
2           2  Fabiana   29.0   Blumenau   6200.0
3           3  Ronaldo   17.0  São Paulo   9300.0
4           4   Eliana    NaN   Salvador   8100.0
5           5   Matias   78.0  São Paulo  15400.0

In [19]:
# Deletando a coluna de índice 0
df_dsa_2 = df_dsa_2.drop(df_dsa_2.columns[0], axis = 1)

In [20]:
# Visualizando as primeiras linhas
df_dsa_2.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

## 3. Seleção e Indexação com Pandas

Existem várias maneiras de selecionar dados de um DataFrame. As mais comuns são loc (baseado em rótulo) e iloc (baseado em posição/índice numérico).

In [21]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [22]:
# Selecionando uma única coluna (retorna uma Series)
nomes = df_dsa['Nome']
print("\n--- Selecionando a coluna 'Nome' ---\n")
print(nomes)
print("\n")

--- Selecionando a coluna 'Nome' ---

0        Ana
1      Bruno
2    Fabiana
3    Ronaldo
4     Eliana
5     Matias
Name: Nome, dtype: object

In [23]:
type(nomes)

pandas.core.series.Series

In [24]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [25]:
# Selecionando múltiplas colunas (retorna um DataFrame)
info_pessoal = df_dsa[['Nome', 'Idade']]
print("\n--- Selecionando as colunas 'Nome' e 'Idade' ---\n")
print(info_pessoal)
print("\n")

--- Selecionando as colunas 'Nome' e 'Idade' ---

      Nome  Idade
0      Ana   28.0
1    Bruno   34.0
2  Fabiana   29.0
3  Ronaldo   17.0
4   Eliana    NaN
5   Matias   78.0

In [26]:
type(info_pessoal)

pandas.core.frame.DataFrame

In [27]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [28]:
# Usando .loc para selecionar pela linha (rótulo/índice 1) e coluna ('Nome')
nome = df_dsa.loc[1, 'Nome']
print(f"\n--- Selecionando com .loc[1, 'Nome'] ---\n{nome}\n")

--- Selecionando com .loc[1, 'Nome'] ---
Bruno

In [29]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [30]:
# Usando .iloc para selecionar pela posição da linha (linha 2) e da coluna (coluna 3)
salario_fabiana = df_dsa.iloc[2, 3]
print(f"\n--- Selecionando com .iloc[2, 3] ---\n{salario_fabiana}\n")

--- Selecionando com .iloc[2, 3] ---
6200.0

In [31]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [32]:
# Selecionando um intervalo de linhas
primeiras_tres_linhas = df_dsa.loc[0:2] # O final (2) é inclusivo com .loc
print("\n--- Selecionando as 3 primeiras linhas com .loc ---\n")
print(primeiras_tres_linhas)

--- Selecionando as 3 primeiras linhas com .loc ---

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0

## 4. Filtragem de Dados com Pandas

Você pode filtrar linhas com base em condições lógicas, de forma muito intuitiva, bem como usar colunas como índice.

In [33]:
# Visualizando as primeiras linhas
df_dsa.head(6)

      Nome  Idade     Cidade  Salário
0      Ana   28.0   Blumenau      NaN
1    Bruno   34.0  São Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Ronaldo   17.0  São Paulo   9300.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  São Paulo  15400.0

In [34]:
# Convertendo a coluna zero em índice
df_dsa = df_dsa.set_index(df_dsa.columns[0])

In [35]:
# Visualizando as primeiras linhas
df_dsa.head(6)

         Idade     Cidade  Salário
Nome
Ana       28.0   Blumenau      NaN
Bruno     34.0  São Paulo   7500.0
Fabiana   29.0   Blumenau   6200.0
Ronaldo   17.0  São Paulo   9300.0
Eliana     NaN   Salvador   8100.0
Matias    78.0  São Paulo  15400.0

In [ ]:
# Filtramos usando label do índice (linha) e da coluna
df_dsa.loc["Fabiana", "Salário"]

In [ ]:
# Podemos aplicar o filtro de forma que retorne um dataframe. Observe a diferença sutil na sintaxe.
df_dsa.loc[["Fabiana"], ["Salário"]]

In [ ]:
# Reset para retornar o índice ao padrão do Pandas
df_dsa = df_dsa.reset_index()

In [ ]:
# Visualizando as primeiras linhas
df_dsa.head(6)

In [ ]:
# Filtrando funcionários com idade superior a 30 anos
mais_de_30 = df_dsa[df_dsa['Idade'] > 30]
print("\n--- Funcionários com mais de 30 anos ---\n")
print(mais_de_30)
print("\n")

In [ ]:
# Filtrando funcionários de São Paulo com salário acima de 6000
sp_salario_alto = df_dsa[(df_dsa['Cidade'] == 'São Paulo') & (df_dsa['Salário'] > 6000)]
print("\n--- Funcionários de São Paulo com salário > 6000 ---\n")
print(sp_salario_alto)

In [ ]:
# Verificamos quais células têm valores nulos
df_dsa.isnull()

In [ ]:
# Verificamos se há qualquer valor nulo em cada coluna
df_dsa.isnull().any()

In [ ]:
# Retorna apenas as colunas que possuem pelo menos um valor nulo
df_dsa_colunas_com_nulos = df_dsa.loc[:, df_dsa.isnull().any()]

In [ ]:
df_dsa_colunas_com_nulos.head()

In [ ]:
# Retorna apenas linhas com valores nulos
df_dsa_linhas_com_nulos = df_dsa[df_dsa.isnull().any(axis = 1)]

In [ ]:
df_dsa_linhas_com_nulos.head()

In [ ]:
# Podemos ainda filtrar pela coluna e então verificar se há valores nulos
linhas_com_nulos_idade = df_dsa[df_dsa["Idade"].isnull()]

In [ ]:
linhas_com_nulos_idade.head()

## 5. Inspeção de DataFrames do Pandas

Podemos inspecionar e resumir o dataframe de várias formas.

In [36]:
# Mostra o número de linhas e colunas (formato)
print(f"\n--- Formato do DataFrame (.shape) ---\n{df_dsa.shape}")

--- Formato do DataFrame (.shape) ---
(6, 3)

In [37]:
# Mostra as 3 primeiras linhas do DataFrame
print("\n--- As 3 primeiras linhas (.head(3)) ---\n")
print(df_dsa.head(3))
print("\n")

--- As 3 primeiras linhas (.head(3)) ---

         Idade     Cidade  Salário
Nome
Ana       28.0   Blumenau      NaN
Bruno     34.0  São Paulo   7500.0
Fabiana   29.0   Blumenau   6200.0

In [38]:
# Mostra as 2 últimas linhas do DataFrame
print("\n--- As 2 últimas linhas (.tail(2)) ---\n")
print(df_dsa.tail(2))
print("\n")

--- As 2 últimas linhas (.tail(2)) ---

        Idade     Cidade  Salário
Nome
Eliana    NaN   Salvador   8100.0
Matias   78.0  São Paulo  15400.0

In [39]:
# Fornece um resumo conciso do DataFrame (tipos de dados, valores não nulos, etc.)
# Observe a contagem de valores
print("\n--- Informações gerais (.info()) ---\n")
df_dsa.info()
print("\n")

--- Informações gerais (.info()) ---

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Ana to Matias
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Idade    5 non-null      float64
 1   Cidade   6 non-null      object
 2   Salário  5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 192.0+ bytes

In [40]:
# Gera estatísticas descritivas das colunas numéricas
print("\n--- Estatísticas descritivas (.describe()) ---\n")
print(df_dsa.describe())
print("\n")

--- Estatísticas descritivas (.describe()) ---

           Idade       Salário
count   5.000000      5.000000
mean   37.200000   9300.000000
std    23.636836   3588.175024
min    17.000000   6200.000000
25%    28.000000   7500.000000
50%    29.000000   8100.000000
75%    34.000000   9300.000000
max    78.000000  15400.000000

In [41]:
print("\n--- Estatísticas descritivas (numéricas e objetos) ---\n")
print(df_dsa.describe(include = 'all'))  # inclui números, objetos e categorias

--- Estatísticas descritivas (numéricas e objetos) ---

            Idade     Cidade       Salário
count    5.000000          6      5.000000
unique        NaN          3           NaN
top           NaN  São Paulo           NaN
freq          NaN          3           NaN
mean    37.200000        NaN   9300.000000
std     23.636836        NaN   3588.175024
min     17.000000        NaN   6200.000000
25%     28.000000        NaN   7500.000000
50%     29.000000        NaN   8100.000000
75%     34.000000        NaN   9300.000000
max     78.000000        NaN  15400.000000

In [42]:
df_dsa.describe(include = [object])   # só colunas do tipo object

           Cidade
count           6
unique          3
top     São Paulo
freq            3

In [43]:
df_dsa.describe(include = [np.number])  # só colunas numéricas (comportamento padrão)

           Idade       Salário
count   5.000000      5.000000
mean   37.200000   9300.000000
std    23.636836   3588.175024
min    17.000000   6200.000000
25%    28.000000   7500.000000
50%    29.000000   8100.000000
75%    34.000000   9300.000000
max    78.000000  15400.000000

## 6. Operações e Transformações de Dados com Pandas

Você pode facilmente criar novas colunas a partir de outras ou aplicar funções para modificar os dados. Fazemos isso com frequência em tarefas de engenharia de atributos em projetos de Ciência de Dados.

In [ ]:
df_dsa.head(6)

In [ ]:
# Criando uma nova coluna 'Salário Anual'
df_dsa['Salário Anual'] = df_dsa['Salário'] * 12
print("\n--- DataFrame com a nova coluna 'Salário Anual' ---\n")
print(df_dsa)
print("\n")

In [ ]:
# Aplicando uma função para criar uma coluna de bônus
# A função lambda aplica a operação para cada valor na coluna 'Salário'
df_dsa['Bônus'] = df_dsa['Salário'].apply(lambda x: x * 0.10 if x > 7000 else x * 0.05)
print("\n--- DataFrame com a nova coluna 'Bônus' ---\n")
print(df_dsa)

Vamos criar uma coluna de faixa etária.

In [ ]:
# Define as condições (vamos criar o que chamamos de máscara)
condicoes = [
    df_dsa['Idade'] < 18,
    (df_dsa['Idade'] >= 18) & (df_dsa['Idade'] <= 30),
    (df_dsa['Idade'] > 30) & (df_dsa['Idade'] <= 60),
    df_dsa['Idade'] > 60
]

In [ ]:
print(condicoes)

In [ ]:
# Define os rótulos correspondentes
faixas = ['Menor de idade', 'Jovem', 'Adulto', 'Idoso']

In [ ]:
# Cria a nova coluna
df_dsa['Faixa Etária'] = np.select(condicoes, faixas, default = 'Idade não informada')

In [ ]:
df_dsa.head(6)

## 7. Agrupamento de Dados (Group By) com Pandas

O método groupby é extremamente poderoso para análises segmentadas. É exatamente o mesmo conceito usado em Linguagem SQL.

In [ ]:
df_dsa.head(6)

In [ ]:
# Agrupando os dados por 'Cidade' e calculando a média de 'Salário' para cada cidade
media_salario_cidade = df_dsa.groupby('Cidade')['Salário'].mean()
print("\n--- Média de Salário por Cidade ---\n")
print(np.round(media_salario_cidade,2))
print("\n")

In [ ]:
# Agrupando por cidade e calculando múltiplas agregações
agregacao_cidade = df_dsa.groupby('Cidade').agg(Media_Salarial = ('Salário', 'mean'),
                                                Idade_Maxima = ('Idade', 'max'),
                                                Contagem = ('Nome', 'count'))

In [ ]:
print("\n--- Agregação múltipla por Cidade ---\n")
print(agregacao_cidade)

## 8. Manipulação de Tipos de Dados com Pandas

Garantir que cada coluna tenha o tipo de dado correto é fundamental para qualquer tipo de análise.

In [ ]:
# Verificando os tipos de dados atuais
print("\n--- Tipos de dados antes da conversão ---\n")
print(df_dsa.dtypes)
print("\n")

In [ ]:
# Convertendo a coluna 'Idade' de float64 para int64 - ATENÇÃO!!!!!
#df_dsa['Idade'] = df_dsa['Idade'].astype(int)

In [ ]:
# Primeiro removemos a linha com valor ausente
df_dsa = df_dsa.dropna(subset = ['Idade'])

# E então fazemos a conversão
df_dsa['Idade'] = df_dsa['Idade'].astype(int)

In [ ]:
print("\n--- Tipos de dados após a conversão ---\n")
print(df_dsa.dtypes)

In [ ]:
# Convertendo do tipo object para o tipo string
df_dsa['Nome'] = df_dsa['Nome'].astype('string')
df_dsa['Cidade'] = df_dsa['Cidade'].astype('string')
df_dsa['Faixa Etária'] = df_dsa['Faixa Etária'].astype('string')

In [ ]:
print("\n--- Tipos de dados após a conversão ---\n")
print(df_dsa.dtypes)

In [ ]:
# Converte todas as colunas do tipo object para string
df_dsa = df_dsa.astype({col: 'string' for col in df_dsa.select_dtypes(include = 'object').columns})

In [ ]:
print("\n--- Tipos de dados após a conversão ---\n")
print(df_dsa.dtypes)

Diferença entre object e string no pandas:

- object é um tipo genérico que armazena qualquer coisa em Python (strings, números, listas, etc.).

- string (desde o Pandas 1.0) é um tipo de dado nativo para texto, pensado para operações mais seguras e consistentes com strings.

Com string, você ganha melhor integração com métodos de texto (.str) e tratamento explícito de valores ausentes (< NA > em vez de NaN misturado com objetos).

Em grandes DataFrames, o tipo string pode ser um pouco mais eficiente e evita confusões quando colunas deveriam ser só texto. Mas não é obrigatório converter, mas usar string ajuda a ter consistência, evitar misturar tipos diferentes na mesma coluna e facilita operações textuais. Para análises e limpeza de dados de texto, geralmente vale a pena.

## 9. Criação de Tabelas Dinâmicas (Pivot Tables) com Pandas

Tabelas dinâmicas são ótimas para resumir dados de forma semelhante a uma planilha.

In [ ]:
# Vamos adicionar mais dados para a tabela dinâmica ficar mais interessante
dados_vendas = {
    'Data': pd.to_datetime(['2026-09-01', '2026-09-01', '2026-09-02', '2026-09-02', '2026-09-01']),
    'Região': ['Norte', 'Sul', 'Norte', 'Sul', 'Norte'],
    'Vendedor': ['Carlos', 'Ana', 'Carlos', 'Ana', 'Pedro'],
    'Vendas': [250, 300, 150, 400, 200]
}

In [ ]:
# Cria o dataframe
df_vendas = pd.DataFrame(dados_vendas)

In [ ]:
df_vendas

In [ ]:
df_vendas.dtypes

In [ ]:
# Criando uma tabela dinâmica para ver o total de vendas por Região e Vendedor
tabela_dinamica = df_vendas.pivot_table(values = 'Vendas', 
                                        index = 'Região', 
                                        columns = 'Vendedor', 
                                        aggfunc = 'sum', 
                                        fill_value = 0)

In [ ]:
print("\n--- Tabela Dinâmica: Total de Vendas por Região e Vendedor ---\n")
tabela_dinamica

## 10. Visualizações de Dados com Pandas e Matplotlib

O Pandas se integra perfeitamente com o Matplotlib para criar visualizações diretamente do DataFrame.

In [ ]:
# É uma boa prática executar este comando em notebooks Jupyter
# para garantir que os gráficos apareçam inline
%matplotlib inline

In [ ]:
# Carrega novamente o dataframe inicial
df_dsa = pd.read_csv('dados_funcionarios_sem_indice.csv')

In [ ]:
df_dsa

In [ ]:
# Calcula a média de salário por cidade
media_salario_cidade = df_dsa.groupby('Cidade')['Salário'].mean()

In [ ]:
type(media_salario_cidade)

In [ ]:
# Gráfico de Barras: Média de Salário por Cidade
media_salario_cidade.plot(kind = 'bar', figsize = (12, 5), color = 'skyblue')

# Adicionando títulos e rótulos
plt.title('Média Salarial Por Cidade')
plt.xlabel('Cidade')
plt.ylabel('Média de Salário (R$)')
plt.xticks(rotation = 45) 
plt.grid(axis = 'y', linestyle = '--')

# Mostra o gráfico
plt.show()

In [ ]:
# Contagem de registros (funcionários) por cidade
contagem_cidade = df_dsa['Cidade'].value_counts()

In [ ]:
type(contagem_cidade)

In [ ]:
contagem_cidade

In [ ]:
# Gráfico de Pizza: Contagem de funcionários por cidade
contagem_cidade.plot(kind = 'pie', autopct = '%1.1f%%', figsize = (6, 6), startangle = 90)
plt.title('Distribuição de Funcionários Por Cidade')
plt.ylabel('') # Remove o rótulo do eixo y
plt.show()

# Fim

Este curso é inteiramente gratuito e com certificado de conclusão. Se estiver gostando, ajude o trabalho da Data Science Academy e compartilhe nas suas redes. Conte para as pessoas o que estamos fazendo aqui, oferecendo material de alto nível de forma gratuita. Este é o link da página do curso:

https://www.datascienceacademy.com.br/course/fundamentos-de-linguagem-python-do-basico-a-aplicacoes-de-ia